// p.481 제어문
// 1) 조건문 : if , if ~ else, if else if ~
// 1-1) 단순 if 
// 1-2) if (조건) {     
//      true 실행 코드;
// }

// 삼항 조건 연산자 ==> 프런트엔드 개발
// 조건 ? true일때 실행 : false일 때 실행 코드;
//  (1)        (2)                (3)
// p.482 3의 배수 확인하기
// 입력 프롬프트에 어떤 값을 입력하면, 3의 배수인지 판단하고 그 결과를 알리는 프로그램
// .prompt() : 입력 프롬프트 메소드
// 연산자 : % (3으로 나누어서 나머지가 0이면, 3의 배수)
// .alert() : 알림 메소드

prompt()




// 2) 선택문 : switch (case)
// 3) 반복문 : for loop, while loop
//      └ 고차 함수 : 함수안에 또다른 함수를 넣어서 실행 ==> .forEach(), .map(), .filter(), .reduce()..